// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//1. перебрати його циклом while
    let arr = [2,17,13,6,22,31,45,66,100,-18];
    let i = 0;
    while (i<arr.length) {
        console.log(arr[i])
        i++;
    }
//2. перебрати його циклом for
    for (let number of arr) {
        console.log(number)
    }
//3. перебрати циклом while та вивести  числа тільки з непарним індексом
    let o = 0;
    while (o<arr.length) {
        if (o % 2 !== 0) {
            console.log(arr[o]);
        }
        o++;
    }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)